{
    "architecture": {
        "class_name": "Model",
        "config": {
            "name": "dummy_model",
            "layers": [
                {
                    "name": "input_1",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            20
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input_1"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "dense_1",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "units": 200,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "input_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "dense_2",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "units": 1,
                        "activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "dense_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_1",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_2",
                    0,
                    0
                ]
            ]
        },
        "keras_version": "2.1.2",
        "backend": "tensorflow"
    },
    "training": {
        "optimizer": {
            "lr": 0.0010000000474974513,
            "beta_1": 0.8999999761581421,
            "beta_2": 0.9990000128746033,
            "decay": 0.0,
            "epsilon": 1e-08,
            "name": "adam"
        },
        "history": [
            {
                "epoch": 0,
                "val_loss": 0.6877079010009766,
                "val_acc": 0.5249999761581421,
                "loss": 0.7131338357925415,
                "acc": 0.45625
            },
            {
                "epoch": 1,
                "val_loss": 0.7100532650947571,
                "val_acc": 0.4749999940395355,
                "loss": 0.6808090925216674,
                "acc": 0.5625
            },
            {
                "epoch": 2,
                "val_loss": 0.738513171672821,
                "val_acc": 0.44999998807907104,
                "loss": 0.6758118510246277,
                "acc": 0.5875
            },
            {
                "epoch": 3,
                "val_loss": 0.753578782081604,
                "val_acc": 0.44999998807907104,
                "loss": 0.6728667974472046,
                "acc": 0.56875
            },
            {
                "epoch": 4,
                "val_loss": 0.7544547319412231,
                "val_acc": 0.44999998807907104,
                "loss": 0.6717876434326172,
                "acc": 0.56875
            },
            {
                "epoch": 5,
                "val_loss": 0.7484807968139648,
                "val_acc": 0.44999998807907104,
                "loss": 0.6681219339370728,
                "acc": 0.56875
            },
            {
                "epoch": 6,
                "val_loss": 0.7368468046188354,
                "val_acc": 0.44999998807907104,
                "loss": 0.6641998291015625,
                "acc": 0.56875
            },
            {
                "epoch": 7,
                "val_loss": 0.7278069257736206,
                "val_acc": 0.5,
                "loss": 0.6585880875587463,
                "acc": 0.56875
            },
            {
                "epoch": 8,
                "val_loss": 0.7189695835113525,
                "val_acc": 0.5,
                "loss": 0.6560335636138916,
                "acc": 0.6
            },
            {
                "epoch": 9,
                "val_loss": 0.7145957946777344,
                "val_acc": 0.5249999761581421,
                "loss": 0.6554596304893494,
                "acc": 0.64375
            },
            {
                "epoch": 10,
                "val_loss": 0.7150201797485352,
                "val_acc": 0.5249999761581421,
                "loss": 0.6542059063911438,
                "acc": 0.675
            },
            {
                "epoch": 11,
                "val_loss": 0.7205988168716431,
                "val_acc": 0.5249999761581421,
                "loss": 0.6515727043151855,
                "acc": 0.675
            },
            {
                "epoch": 12,
                "val_loss": 0.7294344902038574,
                "val_acc": 0.5,
                "loss": 0.6481138110160828,
                "acc": 0.65625
            },
            {
                "epoch": 13,
                "val_loss": 0.7378255724906921,
                "val_acc": 0.5,
                "loss": 0.6462128758430481,
                "acc": 0.64375
            },
            {
                "epoch": 14,
                "val_loss": 0.7414543628692627,
                "val_acc": 0.5,
                "loss": 0.644440495967865,
                "acc": 0.61875
            },
            {
                "epoch": 15,
                "val_loss": 0.7382324934005737,
                "val_acc": 0.5249999761581421,
                "loss": 0.6418538570404053,
                "acc": 0.6375
            },
            {
                "epoch": 16,
                "val_loss": 0.7350550889968872,
                "val_acc": 0.5249999761581421,
                "loss": 0.6397395372390747,
                "acc": 0.64375
            },
            {
                "epoch": 17,
                "val_loss": 0.7333315014839172,
                "val_acc": 0.5249999761581421,
                "loss": 0.6371093153953552,
                "acc": 0.68125
            },
            {
                "epoch": 18,
                "val_loss": 0.732533872127533,
                "val_acc": 0.550000011920929,
                "loss": 0.6356499195098877,
                "acc": 0.68125
            },
            {
                "epoch": 19,
                "val_loss": 0.7387696504592896,
                "val_acc": 0.5249999761581421,
                "loss": 0.6329266786575317,
                "acc": 0.68125
            },
            {
                "epoch": 20,
                "val_loss": 0.7454010844230652,
                "val_acc": 0.5249999761581421,
                "loss": 0.630961012840271,
                "acc": 0.6875
            },
            {
                "epoch": 21,
                "val_loss": 0.7478052377700806,
                "val_acc": 0.5249999761581421,
                "loss": 0.6289036512374878,
                "acc": 0.68125
            },
            {
                "epoch": 22,
                "val_loss": 0.7474883198738098,
                "val_acc": 0.550000011920929,
                "loss": 0.6270595073699952,
                "acc": 0.68125
            },
            {
                "epoch": 23,
                "val_loss": 0.7457401156425476,
                "val_acc": 0.550000011920929,
                "loss": 0.624330711364746,
                "acc": 0.6875
            },
            {
                "epoch": 24,
                "val_loss": 0.7453171014785767,
                "val_acc": 0.574999988079071,
                "loss": 0.6217499732971191,
                "acc": 0.69375
            },
            {
                "epoch": 25,
                "val_loss": 0.7471004128456116,
                "val_acc": 0.550000011920929,
                "loss": 0.6199614048004151,
                "acc": 0.6875
            },
            {
                "epoch": 26,
                "val_loss": 0.7528276443481445,
                "val_acc": 0.550000011920929,
                "loss": 0.6176669836044312,
                "acc": 0.7
            },
            {
                "epoch": 27,
                "val_loss": 0.7544378042221069,
                "val_acc": 0.550000011920929,
                "loss": 0.6154731988906861,
                "acc": 0.69375
            },
            {
                "epoch": 28,
                "val_loss": 0.7502269744873047,
                "val_acc": 0.5,
                "loss": 0.6139272689819336,
                "acc": 0.71875
            },
            {
                "epoch": 29,
                "val_loss": 0.7527576684951782,
                "val_acc": 0.5,
                "loss": 0.6116937041282654,
                "acc": 0.71875
            },
            {
                "epoch": 30,
                "val_loss": 0.7502844929695129,
                "val_acc": 0.5,
                "loss": 0.6104636907577514,
                "acc": 0.725
            },
            {
                "epoch": 31,
                "val_loss": 0.7581521272659302,
                "val_acc": 0.5249999761581421,
                "loss": 0.6074245691299438,
                "acc": 0.73125
            },
            {
                "epoch": 32,
                "val_loss": 0.755409836769104,
                "val_acc": 0.5,
                "loss": 0.6050045728683472,
                "acc": 0.71875
            },
            {
                "epoch": 33,
                "val_loss": 0.7493373155593872,
                "val_acc": 0.4749999940395355,
                "loss": 0.6023221611976624,
                "acc": 0.7375
            },
            {
                "epoch": 34,
                "val_loss": 0.7434002161026001,
                "val_acc": 0.5,
                "loss": 0.6016432642936707,
                "acc": 0.75
            },
            {
                "epoch": 35,
                "val_loss": 0.74662184715271,
                "val_acc": 0.4749999940395355,
                "loss": 0.5990200519561768,
                "acc": 0.74375
            },
            {
                "epoch": 36,
                "val_loss": 0.7557615041732788,
                "val_acc": 0.4749999940395355,
                "loss": 0.5967449426651001,
                "acc": 0.75
            },
            {
                "epoch": 37,
                "val_loss": 0.7592169642448425,
                "val_acc": 0.4749999940395355,
                "loss": 0.594533634185791,
                "acc": 0.75625
            },
            {
                "epoch": 38,
                "val_loss": 0.7587622404098511,
                "val_acc": 0.4749999940395355,
                "loss": 0.5922005295753479,
                "acc": 0.75625
            },
            {
                "epoch": 39,
                "val_loss": 0.7567553520202637,
                "val_acc": 0.5,
                "loss": 0.5907910823822021,
                "acc": 0.75625
            },
            {
                "epoch": 40,
                "val_loss": 0.7514982223510742,
                "val_acc": 0.5,
                "loss": 0.5883967161178589,
                "acc": 0.75
            },
            {
                "epoch": 41,
                "val_loss": 0.7537175416946411,
                "val_acc": 0.5,
                "loss": 0.5861931085586548,
                "acc": 0.75
            },
            {
                "epoch": 42,
                "val_loss": 0.757042407989502,
                "val_acc": 0.5,
                "loss": 0.583768117427826,
                "acc": 0.75625
            },
            {
                "epoch": 43,
                "val_loss": 0.7625967264175415,
                "val_acc": 0.5,
                "loss": 0.5816147208213807,
                "acc": 0.75
            },
            {
                "epoch": 44,
                "val_loss": 0.7641448378562927,
                "val_acc": 0.5,
                "loss": 0.5795376777648926,
                "acc": 0.75625
            },
            {
                "epoch": 45,
                "val_loss": 0.7658328413963318,
                "val_acc": 0.5,
                "loss": 0.5771245002746582,
                "acc": 0.75625
            },
            {
                "epoch": 46,
                "val_loss": 0.7649925351142883,
                "val_acc": 0.5,
                "loss": 0.5749653816223145,
                "acc": 0.75625
            },
            {
                "epoch": 47,
                "val_loss": 0.7626928687095642,
                "val_acc": 0.5,
                "loss": 0.5726602077484131,
                "acc": 0.75
            },
            {
                "epoch": 48,
                "val_loss": 0.7579805850982666,
                "val_acc": 0.4749999940395355,
                "loss": 0.5703961610794067,
                "acc": 0.76875
            },
            {
                "epoch": 49,
                "val_loss": 0.7592884302139282,
                "val_acc": 0.4749999940395355,
                "loss": 0.5686156272888183,
                "acc": 0.775
            },
            {
                "epoch": 50,
                "val_loss": 0.7647949457168579,
                "val_acc": 0.5,
                "loss": 0.5673967957496643,
                "acc": 0.7625
            },
            {
                "epoch": 51,
                "val_loss": 0.7646845579147339,
                "val_acc": 0.4749999940395355,
                "loss": 0.564015555381775,
                "acc": 0.7625
            },
            {
                "epoch": 52,
                "val_loss": 0.7671974301338196,
                "val_acc": 0.5,
                "loss": 0.562207967042923,
                "acc": 0.775
            },
            {
                "epoch": 53,
                "val_loss": 0.7777667045593262,
                "val_acc": 0.5,
                "loss": 0.5597268581390381,
                "acc": 0.775
            },
            {
                "epoch": 54,
                "val_loss": 0.7783232927322388,
                "val_acc": 0.5,
                "loss": 0.5576576232910156,
                "acc": 0.7625
            },
            {
                "epoch": 55,
                "val_loss": 0.7769638299942017,
                "val_acc": 0.5,
                "loss": 0.5550149440765381,
                "acc": 0.76875
            },
            {
                "epoch": 56,
                "val_loss": 0.775097131729126,
                "val_acc": 0.4749999940395355,
                "loss": 0.5526589274406433,
                "acc": 0.76875
            },
            {
                "epoch": 57,
                "val_loss": 0.7759847044944763,
                "val_acc": 0.4749999940395355,
                "loss": 0.5509579658508301,
                "acc": 0.78125
            },
            {
                "epoch": 58,
                "val_loss": 0.7752702832221985,
                "val_acc": 0.4749999940395355,
                "loss": 0.5482263684272766,
                "acc": 0.775
            },
            {
                "epoch": 59,
                "val_loss": 0.7740928530693054,
                "val_acc": 0.4749999940395355,
                "loss": 0.5461763858795166,
                "acc": 0.78125
            },
            {
                "epoch": 60,
                "val_loss": 0.7713904976844788,
                "val_acc": 0.4749999940395355,
                "loss": 0.5449766397476197,
                "acc": 0.78125
            },
            {
                "epoch": 61,
                "val_loss": 0.7781165838241577,
                "val_acc": 0.4749999940395355,
                "loss": 0.5418886661529541,
                "acc": 0.78125
            },
            {
                "epoch": 62,
                "val_loss": 0.7861779928207397,
                "val_acc": 0.5,
                "loss": 0.5392452359199524,
                "acc": 0.7875
            },
            {
                "epoch": 63,
                "val_loss": 0.7903464436531067,
                "val_acc": 0.5,
                "loss": 0.5378324031829834,
                "acc": 0.76875
            },
            {
                "epoch": 64,
                "val_loss": 0.7837055921554565,
                "val_acc": 0.4749999940395355,
                "loss": 0.5364033460617066,
                "acc": 0.76875
            },
            {
                "epoch": 65,
                "val_loss": 0.7864112257957458,
                "val_acc": 0.4749999940395355,
                "loss": 0.5332853078842164,
                "acc": 0.775
            },
            {
                "epoch": 66,
                "val_loss": 0.7930769920349121,
                "val_acc": 0.5,
                "loss": 0.5300771951675415,
                "acc": 0.775
            },
            {
                "epoch": 67,
                "val_loss": 0.7987815141677856,
                "val_acc": 0.5,
                "loss": 0.5290085315704346,
                "acc": 0.775
            },
            {
                "epoch": 68,
                "val_loss": 0.7911592125892639,
                "val_acc": 0.4749999940395355,
                "loss": 0.5258767604827881,
                "acc": 0.775
            },
            {
                "epoch": 69,
                "val_loss": 0.7825008630752563,
                "val_acc": 0.4749999940395355,
                "loss": 0.523967695236206,
                "acc": 0.78125
            },
            {
                "epoch": 70,
                "val_loss": 0.7809799909591675,
                "val_acc": 0.4749999940395355,
                "loss": 0.523624575138092,
                "acc": 0.7875
            },
            {
                "epoch": 71,
                "val_loss": 0.7919619679450989,
                "val_acc": 0.5,
                "loss": 0.5199241816997529,
                "acc": 0.79375
            },
            {
                "epoch": 72,
                "val_loss": 0.803427517414093,
                "val_acc": 0.5,
                "loss": 0.5166599571704864,
                "acc": 0.79375
            },
            {
                "epoch": 73,
                "val_loss": 0.8076398968696594,
                "val_acc": 0.5,
                "loss": 0.515848433971405,
                "acc": 0.78125
            },
            {
                "epoch": 74,
                "val_loss": 0.8006495237350464,
                "val_acc": 0.5,
                "loss": 0.5138453125953675,
                "acc": 0.78125
            },
            {
                "epoch": 75,
                "val_loss": 0.7961364984512329,
                "val_acc": 0.4749999940395355,
                "loss": 0.50986407995224,
                "acc": 0.7875
            },
            {
                "epoch": 76,
                "val_loss": 0.7929483652114868,
                "val_acc": 0.4749999940395355,
                "loss": 0.507907772064209,
                "acc": 0.7875
            },
            {
                "epoch": 77,
                "val_loss": 0.7968648672103882,
                "val_acc": 0.4749999940395355,
                "loss": 0.5056274950504303,
                "acc": 0.8
            },
            {
                "epoch": 78,
                "val_loss": 0.7991175055503845,
                "val_acc": 0.4749999940395355,
                "loss": 0.5026665925979614,
                "acc": 0.8
            },
            {
                "epoch": 79,
                "val_loss": 0.8027864694595337,
                "val_acc": 0.4749999940395355,
                "loss": 0.5005839705467224,
                "acc": 0.8
            },
            {
                "epoch": 80,
                "val_loss": 0.8119124174118042,
                "val_acc": 0.5,
                "loss": 0.4982234716415405,
                "acc": 0.80625
            },
            {
                "epoch": 81,
                "val_loss": 0.8118413686752319,
                "val_acc": 0.5,
                "loss": 0.49779224395751953,
                "acc": 0.8
            },
            {
                "epoch": 82,
                "val_loss": 0.8055928945541382,
                "val_acc": 0.5,
                "loss": 0.4939615488052368,
                "acc": 0.8
            },
            {
                "epoch": 83,
                "val_loss": 0.7999886274337769,
                "val_acc": 0.4749999940395355,
                "loss": 0.49098671674728395,
                "acc": 0.8125
            },
            {
                "epoch": 84,
                "val_loss": 0.7980284690856934,
                "val_acc": 0.4749999940395355,
                "loss": 0.4892303943634033,
                "acc": 0.8125
            },
            {
                "epoch": 85,
                "val_loss": 0.8065207600593567,
                "val_acc": 0.4749999940395355,
                "loss": 0.48647533655166625,
                "acc": 0.8125
            },
            {
                "epoch": 86,
                "val_loss": 0.8126052618026733,
                "val_acc": 0.5,
                "loss": 0.4846593141555786,
                "acc": 0.81875
            },
            {
                "epoch": 87,
                "val_loss": 0.8167445063591003,
                "val_acc": 0.5,
                "loss": 0.4818475365638733,
                "acc": 0.825
            },
            {
                "epoch": 88,
                "val_loss": 0.8131645321846008,
                "val_acc": 0.4749999940395355,
                "loss": 0.4796483516693115,
                "acc": 0.81875
            },
            {
                "epoch": 89,
                "val_loss": 0.8071702718734741,
                "val_acc": 0.4749999940395355,
                "loss": 0.4763767957687378,
                "acc": 0.825
            },
            {
                "epoch": 90,
                "val_loss": 0.8039407730102539,
                "val_acc": 0.4749999940395355,
                "loss": 0.4746299386024475,
                "acc": 0.81875
            },
            {
                "epoch": 91,
                "val_loss": 0.808785617351532,
                "val_acc": 0.4749999940395355,
                "loss": 0.472249710559845,
                "acc": 0.81875
            },
            {
                "epoch": 92,
                "val_loss": 0.8151901960372925,
                "val_acc": 0.4749999940395355,
                "loss": 0.4693096518516541,
                "acc": 0.825
            },
            {
                "epoch": 93,
                "val_loss": 0.8229345083236694,
                "val_acc": 0.5,
                "loss": 0.46711111068725586,
                "acc": 0.83125
            },
            {
                "epoch": 94,
                "val_loss": 0.8194201588630676,
                "val_acc": 0.5,
                "loss": 0.4663460373878479,
                "acc": 0.81875
            },
            {
                "epoch": 95,
                "val_loss": 0.8100937008857727,
                "val_acc": 0.4749999940395355,
                "loss": 0.46212211847305296,
                "acc": 0.83125
            },
            {
                "epoch": 96,
                "val_loss": 0.8058359026908875,
                "val_acc": 0.4749999940395355,
                "loss": 0.4600887656211853,
                "acc": 0.83125
            },
            {
                "epoch": 97,
                "val_loss": 0.8122574090957642,
                "val_acc": 0.4749999940395355,
                "loss": 0.45863592624664307,
                "acc": 0.825
            },
            {
                "epoch": 98,
                "val_loss": 0.8257028460502625,
                "val_acc": 0.4749999940395355,
                "loss": 0.4545948624610901,
                "acc": 0.81875
            },
            {
                "epoch": 99,
                "val_loss": 0.8291350603103638,
                "val_acc": 0.5,
                "loss": 0.4532657742500305,
                "acc": 0.8375
            }
        ]
    },
    "ascii": "  InputLayer (None, 20)  \n       Dense (None, 200) \n       Dense (None, 1)   \n",
    "summary": "_________________________________________________________________\nLayer (type)                 Output Shape              Param #   \n=================================================================\ninput_1 (InputLayer)         (None, 20)                0         \n_________________________________________________________________\ndense_1 (Dense)              (None, 200)               4200      \n_________________________________________________________________\ndense_2 (Dense)              (None, 1)                 201       \n=================================================================\nTotal params: 4,401\nTrainable params: 4,401\nNon-trainable params: 0\n_________________________________________________________________\n",
    "id": "1515628455.984051"
}